Lopata07/hotspot-arcade/esp32/hotspot-arcade-fw/hotspot-arcade-fw.ino
// Hotspot Arcade firmware for the ESP32-S2 WiFi dev board.
//
// Hosts an open WiFi AP + captive portal that serves a multiplayer game web app
// (streamed from the Flipper into a LittleFS flash partition, then served from flash),
// and acts as the real-time referee over a WebSocket while the Flipper drives the
// session over UART v2. See docs/PROTOCOL.md.
//
// For education/fun on your own hardware. It runs an OPEN access point and a
// catch-all captive page; only operate it where that is allowed.

#include <WiFi.h>
#include <AsyncTCP.h>
#include <ESPAsyncWebServer.h>
#include <DNSServer.h>
#include <esp_wifi.h>
#include <esp_netif.h>
#include <esp_heap_caps.h>
// dhcpserver.h sits at a different path in IDF 4.x (the pinned 2.0.17 core, S2/WROOM) and
// IDF 5.x (the 3.x core the C5 needs), and all we want from it is one flag. Probe for it
// rather than pick a path that only builds on one of the two boards.
#if __has_include(<dhcpserver/dhcpserver.h>)
#include <dhcpserver/dhcpserver.h>
#elif __has_include(<lwip/apps/dhcpserver/dhcpserver.h>)
#include <lwip/apps/dhcpserver/dhcpserver.h>
#else
#define OFFER_DNS 0x02 // DHCP server "also send option 6"; stable across both IDF lines
#endif
#include <lwip/etharp.h>

#include "ha_proto.h"
#include "ha_json.h"
#include "ha_assets.h"
#include "ha_games.h"

// Where the RFC 8908 Captive Portal API lives. Advertised in DHCP option 114 and served
// by ArcadeHandler; deliberately not "/", which is the app itself.
#define HA_CAPTIVE_API_PATH "/captive-api"

#define WS_MSG_MAX 512
#define AP_MAX_CONN 8

// Did DHCP option 114 actually go out? Reported in the beacon so the host can tell "we
// never advertised the portal API" apart from "we did and the phone ignored it" -- two very
// different problems that look identical from the sofa.
static bool captiveApiOk = false;
static DNSServer dnsServer;
static AsyncWebServer server(80);
static AsyncWebSocket ws("/ws");
static IPAddress apIP(192, 168, 4, 1);
static char apName[33] = "Hotspot Arcade";
static char apPass[64] = ""; // "" = open network
static bool portalRunning = false;
static uint8_t apMaxConn = AP_MAX_CONN;
static bool fsReady = false; // LittleFS mounted (bundle store)

static AssetStore assets;
static Engine engine;

// ---------------- status LED ----------------
// The official devboard carries an RGB LED wired to these three pins. They are not
// documented in the Flipper hardware docs; the numbers come from the board's own
// factory firmware (flipperdevices/blackmagic-esp32-s2, main/led.c), which is the
// authoritative source for this board.
//
// Common anode: the pin sinks current, so a LOW duty lights the channel and the PWM
// value has to be inverted. The factory firmware also caps brightness at 20/256 --
// at full duty this LED is genuinely painful to look at on a desk. Same cap here.
#define LED_PIN_RED   6
#define LED_PIN_GREEN 5
#define LED_PIN_BLUE  4
#define LED_FREQ_HZ   5000
#define LED_RES_BITS  8
#define LED_MAX_DUTY  20 // of 255, matching the factory firmware's own cap

// Core 3.x LEDC: channels are assigned by the driver and addressed by PIN, so there
// is no ledcSetup()/ledcAttachPin() pair and no channel number to pick any more.
// (This code was written against the 2.x API, which core 3.x dropped outright.)
static void ledInit() {
    ledcAttach(LED_PIN_RED, LED_FREQ_HZ, LED_RES_BITS);
    ledcAttach(LED_PIN_GREEN, LED_FREQ_HZ, LED_RES_BITS);
    ledcAttach(LED_PIN_BLUE, LED_FREQ_HZ, LED_RES_BITS);
}

// 0..255 per channel, as if this were a normal common-cathode LED -- the inversion
// and the brightness cap are applied here so callers can think in plain RGB.
static void ledSet(uint8_t r, uint8_t g, uint8_t b) {
    ledcWrite(LED_PIN_RED, 255 - ((uint32_t)r * LED_MAX_DUTY) / 255);
    ledcWrite(LED_PIN_GREEN, 255 - ((uint32_t)g * LED_MAX_DUTY) / 255);
    ledcWrite(LED_PIN_BLUE, 255 - ((uint32_t)b * LED_MAX_DUTY) / 255);
}

// Serial (to the Flipper) is written from the loop task and the async web/WS
// task; serialize whole frames so bytes can't interleave. Engine state is also
// touched from both tasks, so guard it too.
static SemaphoreHandle_t serialMutex = nullptr;
static SemaphoreHandle_t engineMutex = nullptr;
#define ENGINE_LOCK() xSemaphoreTakeRecursive(engineMutex, portMAX_DELAY)
#define ENGINE_UNLOCK() xSemaphoreGiveRecursive(engineMutex)

// ---------------- device identity (one phone = one player) ----------------
//
// The engine keys a player on the phone rather than on the socket (see Player in
// ha_games.h), so that a second browser context -- iOS opens the portal in a captive
// mini-browser alongside Safari -- joins the player that phone already has instead of
// becoming a new one. The WebSocket layer only knows a peer IP, and that IP is
// something our own DHCP server made up, so resolve it to the station's MAC (the
// actual device identity) and hand the engine an opaque key built from that.
//
// Phones default to a randomized "private" MAC, but it is stable per SSID: it survives
// reconnects and only changes if the AP is renamed. Exactly the lifetime we need.
//
// The IP -> MAC mapping comes from the AP's own DHCP server: ip_event_ap_staipassigned_t
// carries the assigned address *and* the client MAC, so one event handler can keep a
// small table (the AP caps stations well below HA_STA_MAX). A station that got its lease
// before the handler was installed is missing from it; for those, read the MAC out of
// lwIP's ARP cache instead, and if even that misses, key on the IP.

#define HA_STA_MAX 10 // >= ESP_WIFI_MAX_CONN_NUM: the AP cannot hold more leases
#define HA_KEY_MAC 0x01 // key tag: low 48 bits are a station MAC
#define HA_KEY_IP 0x02 // key tag: low 32 bits are an IPv4 address

struct StaLease {
    uint32_t ip; // 0 = free slot
    uint8_t mac[6];
};
static StaLease staLeases[HA_STA_MAX];
// Written from the WiFi event task, read from the async WS task; the critical section
// is a handful of instructions over a 10-entry array.
static portMUX_TYPE leaseMux = portMUX_INITIALIZER_UNLOCKED;

static uint64_t macDeviceKey(const uint8_t* mac) {
    uint64_t v = 0;
    for(int i = 0; i < 6; i++) v = (v << 8) | mac[i];
    return ((uint64_t)HA_KEY_MAC << 56) | v;
}

