Lopata07/hotspot-arcade/esp32/hotspot-arcade-fw/hotspot-arcade-fw.ino
static void leaseNote(uint32_t ip, const uint8_t* mac) {
    portENTER_CRITICAL(&leaseMux);
    int slot = -1, freeSlot = -1;
    for(int i = 0; i < HA_STA_MAX; i++) {
        if(!staLeases[i].ip) {
            if(freeSlot < 0) freeSlot = i;
        } else if(memcmp(staLeases[i].mac, mac, 6) == 0) {
            slot = i; // same phone, (re)leased
            break;
        } else if(staLeases[i].ip == ip) {
            slot = i; // this address now belongs to a different station
        }
    }
    if(slot < 0) slot = freeSlot >= 0 ? freeSlot : 0;
    staLeases[slot].ip = ip;
    memcpy(staLeases[slot].mac, mac, 6);
    portEXIT_CRITICAL(&leaseMux);
}

static void leaseForget(const uint8_t* mac) {
    portENTER_CRITICAL(&leaseMux);
    for(int i = 0; i < HA_STA_MAX; i++)
        if(staLeases[i].ip && memcmp(staLeases[i].mac, mac, 6) == 0) staLeases[i].ip = 0;
    portEXIT_CRITICAL(&leaseMux);
}

static void leasesClear() {
    portENTER_CRITICAL(&leaseMux);
    memset(staLeases, 0, sizeof(staLeases));
    portEXIT_CRITICAL(&leaseMux);
}

static bool leaseMac(uint32_t ip, uint8_t* out) {
    bool found = false;
    portENTER_CRITICAL(&leaseMux);
    for(int i = 0; i < HA_STA_MAX && !found; i++)
        if(staLeases[i].ip == ip) {
            memcpy(out, staLeases[i].mac, 6);
            found = true;
        }
    portEXIT_CRITICAL(&leaseMux);
    return found;
}

// The address a MAC currently holds, for the log line only (0 if unknown).
static uint32_t leaseIp(const uint8_t* mac) {
    uint32_t ip = 0;
    portENTER_CRITICAL(&leaseMux);
    for(int i = 0; i < HA_STA_MAX && !ip; i++)
        if(staLeases[i].ip && memcmp(staLeases[i].mac, mac, 6) == 0) ip = staLeases[i].ip;
    portEXIT_CRITICAL(&leaseMux);
    return ip;
}

// Fallback for a station whose lease we never saw. Read without the lwIP core lock:
// the ARP table is a fixed static array, so the worst case is reading a half-updated
// entry (a wrong MAC, i.e. one extra player) rather than a bad pointer.
static bool arpMac(uint32_t ip, uint8_t* out) {
    for(size_t i = 0; i < ARP_TABLE_SIZE; i++) {
        ip4_addr_t* eip = nullptr;
        struct netif* nif = nullptr;
        struct eth_addr* eth = nullptr;
        if(etharp_get_entry(i, &eip, &nif, &eth) && eip && eth && eip->addr == ip) {
            memcpy(out, eth->addr, 6);
            return true;
        }
    }
    return false;
}

// Which phone a socket is on, as the opaque key the engine stores. 0 = unknown, which
// makes the engine fall back to one player per connection rather than merging clients.
static uint64_t peerDeviceKey(AsyncWebSocketClient* client) {
    uint32_t ip = (uint32_t)client->remoteIP();
    if(!ip || ip == (uint32_t)apIP) return 0; // not a joined station
    uint8_t mac[6];
    if(leaseMac(ip, mac) || arpMac(ip, mac)) return macDeviceKey(mac);
    return ((uint64_t)HA_KEY_IP << 56) | ip; // last resort: the address itself
}

// Render a key for the serial log: "ip=.. mac=.." when we know both.
static String deviceKeyText(uint64_t key) {
    char b[64];
    if((uint8_t)(key >> 56) == HA_KEY_MAC) {
        uint8_t mac[6];
        for(int i = 0; i < 6; i++) mac[i] = (uint8_t)(key >> (40 - 8 * i));
        uint32_t ip = leaseIp(mac);
        String where = ip ? String("ip=") + IPAddress(ip).toString() + " " : String("");
        snprintf(b, sizeof(b), "mac=%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2],
                 mac[3], mac[4], mac[5]);
        return where + b;
    }
    if((uint8_t)(key >> 56) == HA_KEY_IP)
        return String("ip=") + IPAddress((uint32_t)(key & 0xFFFFFFFFu)).toString() + " mac=?";
    return String("device=unknown");
}

// ---------------- UART TX ----------------

static void uartSend(uint8_t type, const uint8_t* payload, size_t len) {
    if(len > HA_MAX_PAYLOAD) len = HA_MAX_PAYLOAD;
    uint8_t hdr[4] = {HA_SYNC, type, (uint8_t)(len & 0xFF), (uint8_t)(len >> 8)};
    uint8_t crc = ha_crc8_upd(0, type);
    crc = ha_crc8_upd(crc, hdr[2]);
    crc = ha_crc8_upd(crc, hdr[3]);
    for(size_t i = 0; i < len; i++) crc = ha_crc8_upd(crc, payload[i]);

    if(serialMutex) xSemaphoreTake(serialMutex, portMAX_DELAY);
    Serial.write(hdr, 4);
    if(len) Serial.write(payload, len);
    Serial.write(crc);
    if(serialMutex) xSemaphoreGive(serialMutex);
}

static void uartStatus(const char* token) {
    uartSend(HA_MSG_STATUS, (const uint8_t*)token, strlen(token));
}

// ---------------- sinks used by the engine ----------------

void haWsSendWs(uint32_t wsId, const String& msg) {
    if(!wsId) return;
    ws.text(wsId, msg);
}
void haWsBroadcast(const String& msg) {
    ws.textAll(msg);
}
void haUartJoin(uint8_t pid, const char* nick) {
    uint8_t buf[1 + HA_NICK_LEN + 1];
    buf[0] = pid;
    size_t n = strlen(nick);
    if(n > HA_NICK_LEN) n = HA_NICK_LEN;
    memcpy(buf + 1, nick, n);
    uartSend(HA_MSG_JOIN, buf, 1 + n);
}
void haUartLeave(uint8_t pid) {
    uartSend(HA_MSG_LEAVE, &pid, 1);
}
void haUartScore(uint8_t pid, int delta, const char* reason) {
    uint8_t buf[1 + 2 + 24];
    buf[0] = pid;
    int16_t d = (int16_t)delta;
    buf[1] = (uint8_t)(d & 0xFF);
    buf[2] = (uint8_t)((d >> 8) & 0xFF);
    size_t n = strlen(reason);
    if(n > 24) n = 24;
    memcpy(buf + 3, reason, n);
    uartSend(HA_MSG_SCORE, buf, 3 + n);
}
void haUartTotal(uint8_t pid, int32_t total) {
    uint8_t buf[1 + 4];
    buf[0] = pid;
    buf[1] = (uint8_t)(total & 0xFF);
    buf[2] = (uint8_t)((total >> 8) & 0xFF);
    buf[3] = (uint8_t)((total >> 16) & 0xFF);
    buf[4] = (uint8_t)((total >> 24) & 0xFF);
    uartSend(HA_MSG_TOTAL, buf, 5);
}
void haUartEvent(const String& json) {
    uartSend(HA_MSG_EVENT, (const uint8_t*)json.c_str(), json.length());
}
void haUartRoundResult(const String& json) {
    uartSend(HA_MSG_ROUND_RESULT, (const uint8_t*)json.c_str(), json.length());
}
// Finished artwork (Frankendraw). One frame per call -- a sheet header, a single line
// segment, or the end marker -- so a whole drawing streams to the Flipper a segment at
// a time and neither side ever buffers one. Payload is the op byte then the JSON.
void haUartArt(uint8_t op, const String& json) {
    uint8_t buf[192];
    buf[0] = op;
    size_t n = json.length();
    if(n > sizeof(buf) - 1) n = sizeof(buf) - 1;
    memcpy(buf + 1, json.c_str(), n);
    uartSend(HA_MSG_ART, buf, 1 + n);
}

// Debug trace of the engine's identity decisions. Serial is the Flipper link, so a
// log line shares the wire with the framed protocol: safe because the receiver only
// starts a frame on the SYNC byte (0xA5) and resyncs on a bad CRC, and because
// haLog() emits printable ASCII only -- a UTF-8 nickname could otherwise carry a
// literal 0xA5 and be mistaken for the start of a frame. Written under the same
// mutex as a frame, so it can never land inside one.
static void haLog(const String& line) {
    if(serialMutex) xSemaphoreTake(serialMutex, portMAX_DELAY);
    Serial.print("\n[ha] ");
    for(const char* p = line.c_str(); *p; p++)
        Serial.write((*p >= 0x20 && (uint8_t)*p < 0x7F) ? *p : '?');
    Serial.print("\n");
    if(serialMutex) xSemaphoreGive(serialMutex);
}
void haLogJoin(uint8_t pid, uint64_t deviceKey, const char* nick, bool consolidated) {
    String where = deviceKeyText(deviceKey);
    if(consolidated)
        haLog(String("SAME DEVICE ") + where + " -> pid=" + pid + " nick=\"" + nick +
              "\" (consolidated)");
    else
        haLog(String("JOIN pid=") + pid + " " + where + " nick=\"" + nick + "\"");
}

// ---------------- HTTP (captive) ----------------

// Serve the streamed web bundle for every host/path so the captive portal always
// resolves. GET "/" (and every OS captive-probe URL) gets the app; other stored
// asset paths are served by exact match.
class ArcadeHandler : public AsyncWebHandler {
public:
    bool canHandle(AsyncWebServerRequest* request) const override {
        (void)request;
        return true;
    }
    void handleRequest(AsyncWebServerRequest* request) override {
        String url = request->url();
        // RFC 8908 Captive Portal API. This is what DHCP option 114 points at, and it is
        // NOT the portal page: it is a tiny JSON document describing the network's captive
        // state, served as application/captive+json. Answering it with the app's HTML (which
        // is what pointing option 114 at "/" did) makes the phone discard the whole
        // mechanism and fall back to probe sniffing -- the popup still appears, but the
        // persistent "Log In" entry in the OS network settings never does, because as far as
        // the OS is concerned this network has no API.
        if(url == HA_CAPTIVE_API_PATH) {
            AsyncWebServerResponse* r = request->beginResponse(
                200, "application/captive+json",
                "{\"captive\":true,\"user-portal-url\":\"http://192.168.4.1/\"}");
            r->addHeader("Cache-Control", "no-store");
            request->send(r);
            return;
        }
        const Asset* a = assets.find(url.c_str());
        if(!a) a = assets.root(); // captive-detection URLs and "/" -> the app
        // Serve the ~47 KB app to real browsers -- including the iOS captive WINDOW, which is
        // a WebKit view with a "Mozilla" User-Agent, so the app renders there too. The OS
        // captive-detection *probes* (User-Agent "CaptiveNetworkSupport...") fire several at
        // once; serving the bundle from flash to each copies into per-connection TCP buffers
        // and storms the heap, so those get a tiny landing instead.
        bool browser = request->header("User-Agent").indexOf("Mozilla") >= 0;
        // HTTP caching: the bundle CRC is a strong ETag. A client that already holds this exact
        // bundle revalidates with If-None-Match and gets a tiny 304 -- no 47 KB body -- so a
        // reload or an iOS captive re-probe costs nothing instead of re-sending the whole
        // bundle. The ETag changes when the host updates the bundle, so updates are never stale.
        char etag[12] = "";
        if(browser && fsReady && a && a->len) {
            snprintf(etag, sizeof(etag), "\"%08lx\"", (unsigned long)assets.bundleCrc());
            if(request->header("If-None-Match") == etag) {
                AsyncWebServerResponse* nm = request->beginResponse(304);
                nm->addHeader("ETag", etag);
                request->send(nm);
                return;
            }
        }
        File f;
        if(browser && fsReady && a && a->len) f = LittleFS.open(a->fsname, "r");
        if(!f) {
            request->send(200, "text/html",
                          "<!doctype html><meta name=viewport content='width=device-width,initial-scale=1'>"
                          "<body style='margin:0;background:#0b0b12;color:#eee;text-align:center;"
                          "font:16px system-ui,sans-serif;padding:2.5em 1em'><h2>Hotspot Arcade</h2>"
                          "<p>Open <b>192.168.4.1</b> in your browser to play.</p></body>");
            return;
        }
        // Streamed from flash (no RAM copy). The stored name ends ".gz" while a->path does
        // not, so AsyncFileResponse sets Content-Encoding: gzip for us; mime is explicit.
        AsyncWebServerResponse* res = request->beginResponse(f, String(a->path), (const char*)a->mime);
        res->addHeader("ETag", etag);
        res->addHeader("Cache-Control", "no-cache");
        request->send(res);
    }
};

// ---------------- WebSocket ----------------

