Lopata07/hotspot-arcade/esp32/hotspot-arcade-fw/hotspot-arcade-fw.ino
static void onWsEvent(
    AsyncWebSocket* srv,
    AsyncWebSocketClient* client,
    AwsEventType type,
    void* arg,
    uint8_t* data,
    size_t len) {
    (void)srv;
    if(type == WS_EVT_CONNECT) {
        // Every push is a whole snapshot -- pushAll() sends the lobby plus the full
        // game state, never a delta -- so a frame that goes missing is repaired by
        // the next one a moment later. The library's default trade is the opposite:
        // when a client's send queue fills up it closes the connection. On a phone
        // that dozed off for a second that is the difference between a stutter and
        // losing your seat mid-round, and it looks to the room like a random drop.
        // Discard the frame instead; the next push carries the same truth.
        client->setCloseClientOnQueueFull(false);
    } else if(type == WS_EVT_DISCONNECT) {
        ENGINE_LOCK();
        engine.onWsDisconnect(client->id());
        ENGINE_UNLOCK();
    } else if(type == WS_EVT_DATA) {
        AwsFrameInfo* info = (AwsFrameInfo*)arg;
        if(info->final && info->index == 0 && info->len == len && info->opcode == WS_TEXT &&
           len < WS_MSG_MAX) {
            char buf[WS_MSG_MAX];
            memcpy(buf, data, len);
            buf[len] = '\0';
            ENGINE_LOCK();
            engine.onInput(client->id(), peerDeviceKey(client), buf);
            ENGINE_UNLOCK();
        }
    }
}

// ---------------- AP lifecycle ----------------

// The AP's DHCP server is where a station's IP and MAC are seen together. Registered
// once in setup(), before any AP comes up, so no lease is missed (see peerDeviceKey).
static void onWiFiEvent(WiFiEvent_t event, WiFiEventInfo_t info) {
    if(event == ARDUINO_EVENT_WIFI_AP_STAIPASSIGNED)
#if ESP_ARDUINO_VERSION_MAJOR >= 3
        // esp-idf 5+ (Arduino core 3.x, e.g. the C5): the assign event carries the MAC.
        leaseNote(info.wifi_ap_staipassigned.ip.addr, info.wifi_ap_staipassigned.mac);
#else
        // esp-idf 4.x (Arduino core 2.0.x, the S2/WROOM): the staipassigned event has no
        // MAC field, so we can't record the lease here. peerDeviceKey() then resolves the
        // station from the lwIP ARP cache at hello() time, which by then holds its entry.
        (void)info;
#endif
    else if(event == ARDUINO_EVENT_WIFI_AP_STADISCONNECTED)
        leaseForget(info.wifi_ap_stadisconnected.mac);
}

// Tell joining phones two things at once: who resolves names here, and where the portal
// is. Both are DHCP options, both need the server stopped to set, so they share one restart
// rather than bouncing it twice while a station may already be probing.
//
// ---- Option 6, the DNS server ----
//
// Without this the AP leases an address and a gateway but NO resolver: esp_netif's DHCP
// server does not offer DNS unless it is asked to, and Arduino's softAPConfig() never asks
// (set_esp_interface_ip only touches the address info). A phone then cannot resolve the
// hostname its OS probes to decide whether a network is captive -- captive.apple.com on
// iOS, connectivitycheck.gstatic.com on Android -- so the probe fails to resolve instead of
// being intercepted.
//
// That distinction is the whole bug. A probe that is answered with the wrong page means
// "captive" and opens the portal; a probe that cannot even resolve means "no internet", and
// iOS says exactly that and offers nothing. Typing 192.168.4.1 by hand still worked the
// whole time, because an IP needs no lookup, which is what kept this hidden. The wildcard
// DNSServer below was always ready to answer; nothing was telling the phones to ask it.
//
// ---- Option 114, the Captive Portal API (RFC 8910) ----
//
// Option 6 gets the OS probe working again, which is enough to make the portal pop up by
// itself. Option 114 is the better mechanism and the one modern in-flight WiFi uses: it
// hands the phone the portal URL outright, so the OS marks the network captive without
// having to be tricked by a probe response, and iOS keeps a persistent entry for it in
// WiFi settings instead of a popup you can dismiss and never find again.
//
// This is why every board is on the 3.x core now: ESP_NETIF_CAPTIVEPORTAL_URI does not
// exist in the 2.0.17 line at all, and the Arduino helper for it is gated at IDF 5.4.2.
static void apAnnouncePortal() {
    esp_netif_t* ap = esp_netif_get_handle_from_ifkey("WIFI_AP_DEF");
    if(!ap) return;
    esp_netif_dns_info_t dns = {};
    dns.ip.type = ESP_IPADDR_TYPE_V4;
    dns.ip.u_addr.ip4.addr = (uint32_t)apIP;
    // Options can only be set while the server is stopped, so do all of them in one window.
    esp_netif_dhcps_stop(ap);
    esp_netif_set_dns_info(ap, ESP_NETIF_DNS_MAIN, &dns);
    uint8_t offer = OFFER_DNS;
    esp_netif_dhcps_option(ap, ESP_NETIF_OP_SET, ESP_NETIF_DOMAIN_NAME_SERVER, &offer, sizeof(offer));
    // Option 114 goes in the SAME stopped window rather than through Arduino's
    // WiFi.AP.enableDhcpCaptivePortal(), for two reasons. That helper hardcodes the URI to
    // "http://<ip>", the app's own page, which is the wrong thing to advertise -- the option
    // must point at the RFC 8908 API endpoint, not at the portal. And it bounces the DHCP
    // server a second time, right when a station may already be probing.
    //
    // esp_netif keeps the POINTER we hand it rather than copying the string, so this buffer
    // is static and outlives the call.
    static char captiveUri[40];
    snprintf(captiveUri, sizeof(captiveUri), "http://%s%s",
             apIP.toString().c_str(), HA_CAPTIVE_API_PATH);
    esp_err_t cperr = esp_netif_dhcps_option(
        ap, ESP_NETIF_OP_SET, ESP_NETIF_CAPTIVEPORTAL_URI, captiveUri, strlen(captiveUri));
    esp_netif_dhcps_start(ap);
    captiveApiOk = (cperr == ESP_OK); // reported in the PING beacon, see below
}

static void startPortal() {
    leasesClear(); // a fresh session leases fresh addresses
    WiFi.mode(WIFI_AP);
    WiFi.softAPConfig(apIP, apIP, IPAddress(255, 255, 255, 0));
    // A non-empty password switches the driver to WPA2-PSK; empty keeps the
    // network open. apPass is validated Flipper-side (0 or 8-63 chars) before it's
    // ever sent, but WiFi.softAP() itself would just silently misbehave on 1-7
    // chars, so that floor lives entirely in the UI (Task 4), not here.
    WiFi.softAP(apName, apPass[0] ? apPass : nullptr, 1, 0, apMaxConn);
    delay(100);
    apAnnouncePortal(); // before any station leases, or the first joiner gets neither
    uartStatus("ap_ok");

    dnsServer.start(53, "*", apIP);
    ws.onEvent(onWsEvent);
    server.addHandler(&ws);
    server.addHandler(new ArcadeHandler()).setFilter(ON_AP_FILTER);
    server.begin();
    portalRunning = true;

    // Green = AP up and WPA2-protected, amber = AP up but OPEN. Worth distinguishing:
    // an open AP is the one state where a passer-by can join, and the Flipper's own
    // menu can't prove what the radio actually did with the password it sent.
    if(apPass[0])
        ledSet(0, 255, 0);
    else
        ledSet(255, 90, 0);

    String up = String("up ip=") + WiFi.softAPIP().toString();
    uartStatus(up.c_str());
}

static void stopPortal() {
    if(portalRunning) {
        ws.closeAll();
        server.end();
        dnsServer.stop();
        WiFi.softAPdisconnect(true);
        portalRunning = false;
    }
    leasesClear();
    ENGINE_LOCK();
    engine.reset();
    ENGINE_UNLOCK();
    ledSet(0, 0, 40); // back to dim blue: idle, no AP
    uartStatus("stopped");
}

// ---------------- UART RX (framed) ----------------

enum RxState { RX_SYNC, RX_TYPE, RX_LEN0, RX_LEN1, RX_PAYLOAD, RX_CRC, RX_RAW };
static RxState rxState = RX_SYNC;
static uint8_t rxType = 0;
static uint16_t rxLen = 0, rxIdx = 0;
static uint8_t rxCrc = 0;
// The framed protocol's receive buffer, allocated once at boot and never freed.
//
// It is 4 KB and it used to be static, which the linker has to reserve inside the S2's
// dram0 segment whether a session is running or not. Off the heap it costs the same RAM
// on a board with no PSRAM, but it stops the LINK depending on it, and on the S2 it lands
// in PSRAM and is genuinely gone from internal memory. Sized once because every frame is
// bounded by HA_MAX_PAYLOAD, so there is nothing to grow or shrink at runtime.
static uint8_t* rxBuf = nullptr;

// FILE_BEGIN payload: flags(1) pathlen(1) path mimelen(1) mime total(4 LE)
static void handleFileBegin(const uint8_t* p, size_t len) {
    if(len < 3) return;
    size_t i = 0;
    uint8_t flags = p[i++];
    uint8_t pathlen = p[i++];
    if(i + pathlen + 1 > len) return;
    char path[HA_ASSET_PATH];
    size_t pl = pathlen < HA_ASSET_PATH - 1 ? pathlen : HA_ASSET_PATH - 1;
    memcpy(path, p + i, pl);
    path[pl] = '\0';
    i += pathlen;
    uint8_t mimelen = p[i++];
    if(i + mimelen + 4 > len) return;
    char mime[HA_ASSET_MIME];
    size_t ml = mimelen < HA_ASSET_MIME - 1 ? mimelen : HA_ASSET_MIME - 1;
    memcpy(mime, p + i, ml);
    mime[ml] = '\0';
    i += mimelen;
    uint32_t total = (uint32_t)p[i] | ((uint32_t)p[i + 1] << 8) | ((uint32_t)p[i + 2] << 16) |
                     ((uint32_t)p[i + 3] << 24);
    assets.begin(path, mime, flags & 1, total);
}

static void dispatchFrame() {
    rxBuf[rxLen] = '\0'; // JSON payloads are text; safe (buf has +1)
    switch(rxType) {
    case HA_MSG_CLEAR_FILES:
        assets.clear();
        uartStatus("cleared");
        break;
    case HA_MSG_FILE_BEGIN:
        handleFileBegin(rxBuf, rxLen);
        if(assets.receiving()) {
            rxState = RX_RAW; // the file bytes follow, unframed
            return;
        }
        uartStatus("fok"); // zero-length file committed immediately
        break;
    case HA_MSG_SET_AP:
        if(rxLen > 0) {
            // Payload is "SSID\0PASSWORD". A NUL inside rxLen means the sending
            // Flipper knows about the password field; without one (older Flipper
            // build) the whole payload is just the SSID, same as before this change.
            size_t ssidLen = 0;
            while(ssidLen < rxLen && rxBuf[ssidLen] != '\0') ssidLen++;
            size_t n = ssidLen < sizeof(apName) - 1 ? ssidLen : sizeof(apName) - 1;
            memcpy(apName, rxBuf, n);
            apName[n] = '\0';

