Lopata07/hotspot-arcade/esp32/hotspot-arcade-fw/hotspot-arcade-fw.ino
            if(ssidLen < rxLen) {
                size_t passStart = ssidLen + 1;
                size_t passLen = rxLen - passStart;
                size_t pn = passLen < sizeof(apPass) - 1 ? passLen : sizeof(apPass) - 1;
                memcpy(apPass, rxBuf + passStart, pn);
                apPass[pn] = '\0';
            } else {
                apPass[0] = '\0';
            }
        }
        assets.finishStream(); // file phase done: persist the bundle + its CRC if it changed
        uartStatus("ap_set");
        break;
    case HA_MSG_START:
        startPortal();
        break;
    case HA_MSG_STOP:
        stopPortal();
        break;
    case HA_MSG_RESET:
        uartStatus("resetting");
        delay(50);
        ESP.restart();
        break;
    case HA_MSG_SELECT_GAME:
        if(rxLen >= 1) {
            ENGINE_LOCK();
            engine.selectGame(rxBuf[0]);
            ENGINE_UNLOCK();
        }
        break;
    case HA_MSG_CONTENT_CLEAR:
        ENGINE_LOCK();
        engine.contentClear();
        ENGINE_UNLOCK();
        break;
    case HA_MSG_CONTENT_PACK:
        // payload: game byte, then the pack name (not NUL-terminated on the wire).
        if(rxLen >= 2) {
            char name[64];
            size_t n = rxLen - 1 < sizeof(name) - 1 ? (size_t)(rxLen - 1) : sizeof(name) - 1;
            memcpy(name, rxBuf + 1, n);
            name[n] = '\0';
            ENGINE_LOCK();
            engine.contentPack(rxBuf[0], name);
            ENGINE_UNLOCK();
        }
        break;
    case HA_MSG_CONTENT_ITEM:
        ENGINE_LOCK();
        engine.contentItem((const char*)rxBuf);
        ENGINE_UNLOCK();
        break;
    case HA_MSG_ROUND_END:
        ENGINE_LOCK();
        engine.roundEnd();
        ENGINE_UNLOCK();
        break;
    case HA_MSG_CONFIG: {
        int v;
        if(ha_json_int((const char*)rxBuf, "max", &v) && v >= 1 && v <= 15) apMaxConn = (uint8_t)v;
        char lang[8];
        if(ha_json_str((const char*)rxBuf, "lang", lang, sizeof(lang))) {
            ENGINE_LOCK();
            engine.setLang(lang);
            ENGINE_UNLOCK();
        }
        break;
    }
    case HA_MSG_RESET_SCORES:
        ENGINE_LOCK();
        engine.resetScores();
        ENGINE_UNLOCK();
        break;
    default:
        break;
    }
    rxState = RX_SYNC;
}

static void rxByte(uint8_t c) {
    switch(rxState) {
    case RX_SYNC:
        if(c == HA_SYNC) rxState = RX_TYPE;
        break;
    case RX_TYPE:
        rxType = c;
        rxCrc = ha_crc8_upd(0, c);
        rxState = RX_LEN0;
        break;
    case RX_LEN0:
        rxLen = c;
        rxCrc = ha_crc8_upd(rxCrc, c);
        rxState = RX_LEN1;
        break;
    case RX_LEN1:
        rxLen |= ((uint16_t)c << 8);
        rxCrc = ha_crc8_upd(rxCrc, c);
        if(rxLen > HA_MAX_PAYLOAD) {
            rxState = RX_SYNC; // bogus length, resync
            break;
        }
        rxIdx = 0;
        rxState = rxLen ? RX_PAYLOAD : RX_CRC;
        break;
    case RX_PAYLOAD:
        if(!rxBuf) { rxState = RX_SYNC; break; } // no buffer: drop the frame, stay in sync
        rxBuf[rxIdx++] = c;
        rxCrc = ha_crc8_upd(rxCrc, c);
        if(rxIdx >= rxLen) rxState = RX_CRC;
        break;
    case RX_CRC:
        if(c == rxCrc) {
            dispatchFrame(); // sets next state (RX_SYNC or RX_RAW)
        } else {
            rxState = RX_SYNC; // corrupt frame, drop and resync
        }
        break;
    case RX_RAW:
        break; // handled in bulk below
    }
}

static void pumpSerial() {
    while(Serial.available()) {
        if(rxState == RX_RAW) {
            // Bulk asset bytes: drain as many as we still need in one go.
            size_t need = assets.remaining();
            if(need == 0) {
                rxState = RX_SYNC;
                uartStatus("fok");
                continue;
            }
            uint8_t tmp[256];
            size_t want = need < sizeof(tmp) ? need : sizeof(tmp);
            int got = Serial.read(tmp, want);
            if(got > 0) assets.feed(tmp, (size_t)got);
            if(assets.remaining() == 0) {
                rxState = RX_SYNC;
                uartStatus("fok");
            }
        } else {
            rxByte((uint8_t)Serial.read());
        }
    }
}

// ---------------- Arduino entry ----------------

// How big an allocation has to be before it is allowed to live in PSRAM.
//
// The core boots this at CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL, which the 3.x SDK ships as
// 4096, so everything smaller than 4 KB is forced into internal RAM no matter how much
// PSRAM is free. An async web server's per-connection allocations are nearly all smaller
// than that, which is exactly why the board could sit on 1.9 MB of unused PSRAM while its
// internal heap drained to 11 KB and a second phone could not finish associating.
//
// Dropping it to 1 KB lets PSRAM take the bulk of that traffic. Allocations that genuinely
// must be internal -- DMA buffers, anything an ISR touches -- ask for those capabilities
// explicitly and are unaffected by this limit; it only steers plain malloc().
#define HA_PSRAM_MALLOC_FLOOR 1024

void setup() {
    // Before anything allocates. No-op on a board without PSRAM, where there is nowhere
    // else for these to go and the internal heap is all there is.
    if(ESP.getPsramSize() > 0) heap_caps_malloc_extmem_enable(HA_PSRAM_MALLOC_FLOOR);

    serialMutex = xSemaphoreCreateMutex();
    engineMutex = xSemaphoreCreateRecursiveMutex();
    ledInit();
    // Boot blink: the only sign of life this board gives on its own. Serial goes to
    // UART0 (the Flipper's GPIO header), not USB-CDC, so a board sitting on a desk
    // with just a USB cable enumerates nothing and shows nothing -- this blink is
    // what tells you the firmware is actually running rather than the board being dead.
    ledSet(255, 0, 0);
    delay(150);
    ledSet(0, 0, 0);
    WiFi.onEvent(onWiFiEvent, ARDUINO_EVENT_WIFI_AP_STAIPASSIGNED);
    WiFi.onEvent(onWiFiEvent, ARDUINO_EVENT_WIFI_AP_STADISCONNECTED);
    Serial.setRxBufferSize(4096);
    Serial.begin(HA_UART_BAUD);
    delay(100);
    // Mount the bundle store (formats the spiffs-labelled partition as LittleFS on first
    // boot) and load any bundle a previous session persisted. maxOpenFiles is raised
    // because AsyncFileResponse holds a File open per in-flight response.
    // Before the first byte can arrive. ps_malloc prefers PSRAM (the S2) and falls back to
    // internal heap; if even that fails there is no way to receive a frame, so say so on the
    // wire rather than writing through a null pointer on the first byte.
    rxBuf = (uint8_t*)ps_malloc(HA_MAX_PAYLOAD + 1);
    if(!rxBuf) rxBuf = (uint8_t*)malloc(HA_MAX_PAYLOAD + 1);
    if(!rxBuf) uartStatus("err_rxbuf");

    fsReady = LittleFS.begin(true, "/littlefs", 16);
    if(fsReady) assets.load();
    engine.reset();
    ledSet(0, 0, 40); // dim blue: alive, waiting for the Flipper to start a session
    uartStatus("boot");
}

void loop() {
    if(portalRunning) {
        dnsServer.processNextRequest();
        ws.cleanupClients();
        ENGINE_LOCK();
        engine.tick(millis());
        ENGINE_UNLOCK();
    }
    pumpSerial();

    static uint32_t lastPing = 0;
    uint32_t now = millis();
    if(now - lastPing >= 2000) {
        lastPing = now;
        // Identity beacon: magic + version + the CRC of the web bundle we hold in flash +
        // the current game id. Version flags an outdated board; the CRC lets the Flipper skip
        // re-streaming an unchanged bundle; the game id lets it mirror phone-vote game changes
        // reliably. Bytes 6-10 are new in v19; bytes 11-14 (free heap KB, free PSRAM KB, LE
        // uint16 each) are new in v1.7.1 for the Flipper's memory readout. Older Flippers read
        // only the bytes they know and ignore the rest, so growing this stays compatible.
        uint32_t bcrc = fsReady ? assets.bundleCrc() : 0;
        uint16_t heapKb = (uint16_t)(ESP.getFreeHeap() / 1024);
        uint16_t psramKb = (uint16_t)(ESP.getFreePsram() / 1024);
        // Free heap is a snapshot and the interesting failure is a slow drain, so send the
        // low-water mark since boot alongside it: that is what shows a leak in a way a
        // sampled number cannot. Older Flippers read only the bytes they know.
        uint16_t minHeapKb = (uint16_t)(ESP.getMinFreeHeap() / 1024);
        uint8_t flags = captiveApiOk ? 0x01 : 0x00;
        uint8_t beacon[18] = {
            HA_FW_MAGIC_0,
            HA_FW_MAGIC_1,
            HA_FW_MAGIC_2,
            HA_FW_MAGIC_3,
            (uint8_t)(HA_FW_VERSION & 0xFF),
            (uint8_t)(HA_FW_VERSION >> 8),
            (uint8_t)(bcrc & 0xFF),
            (uint8_t)((bcrc >> 8) & 0xFF),
            (uint8_t)((bcrc >> 16) & 0xFF),
            (uint8_t)((bcrc >> 24) & 0xFF),
            engine.activeGame(),
            (uint8_t)(heapKb & 0xFF),
            (uint8_t)(heapKb >> 8),
            (uint8_t)(psramKb & 0xFF),
            (uint8_t)(psramKb >> 8),
            (uint8_t)(minHeapKb & 0xFF),
            (uint8_t)(minHeapKb >> 8),
            flags};
        uartSend(HA_MSG_PING, beacon, sizeof(beacon));
    }
}
